cases/hydrodynamics/floatingObject_spring-v18.06/background/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{
	alpha           alpha.water;
	
	waveModel       irregularMultiDirectional;
	
	nPaddle         1;
	
	waveAngle       0.0;

	rampTime        2.58;

	activeAbsorption yes;

	wavePeriods
	22
	(
	(3.846154)
	(3.571429)
	(3.333333)
	(3.125000)
	(2.941176)
	(2.777778)
	(2.631579)
	(2.500000)
	(2.380952)
	(2.272727)
	(2.173913)
	(2.083333)
	(2.000000)
	(1.923077)
	(1.851852)
	(1.785714)
	(1.724138)
	(1.666667)
	(1.612903)
	(1.562500)
	(1.515152)
	(1.470588)
	);
	waveHeights
	22
	(
	(0.017078)
	(0.031659)
	(0.046804)
	(0.060794)
	(0.077035)
	(0.103648)
	(0.133916)
	(0.133953)
	(0.110927)
	(0.087705)
	(0.073356)
	(0.065584)
	(0.060678)
	(0.056679)
	(0.052983)
	(0.049489)
	(0.046203)
	(0.043134)
	(0.040282)
	(0.037640)
	(0.035198)
	(0.032945)
	);
	wavePhases
	22
	(
	(-0.647147)
	(0.396593)
	(1.497292)
	(-2.069643)
	(-1.043911)
	(0.312121)
	(-1.221897)
	(0.441867)
	(-2.934060)	
	(-2.112654)
	(0.413123)
	(-0.717731)
	(-0.960080)
	(0.703130)
	(-1.959935)
	(-2.476947)
	(0.882513)
	(-1.305369)
	(2.134763)
	(1.456242)
	(2.897259)
	(0.367120)
	);
	waveDirs
	22
	(
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)		
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	(0.000000)
	);
}

outlet
{	
	alpha           alpha.water;

	waveModel       shallowWaterAbsorption;

	nPaddle         1;
}

// ************************************************************************* //

